"""Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд], потім перемножити цю суму на останній елемент вхідного масиву.

Не забудьте, що перший елемент масиву має індекс 0.

Для порожнього масиву результат завжди 0."""
numbers = [ 2, 3, 4, 5]


if not numbers:
    result = 0
else:
    result = sum(numbers[::2]) * numbers[-1]

print(result)

number2 =[0,1,7,2,4,8]

if not number2:
    result = 0
else:
    result = sum(number2[::2]) * number2[-1]

print(result)